// src/components/WelcomeTile.tsx
import React from 'react';
import portrait from '../../assets/images/portrait.png';
import style from './WelcomeTile.module.scss';
import Image from '../Image/Image';
import Boat from '../../assets/icons/Boat';

const WelcomeTile: React.FC = () => {
  return (
    <div className={style.welcomeTile}>
      <div className={style.bgPattern}>
        <Boat />
      </div>

      <Image src={portrait} className={style.imageWrapper} />

      <div>
        <h1>[Ваше Ім'я!!!]</h1>
        <p>
          <strong>
            Про мене:
          </strong>

          Я сертифікований терапевт з [кількість років] досвіду в гештальт-терапії. Моя практика орієнтована на підтримку людей у пошуку внутрішнього балансу та глибшого розуміння себе. Я вірю, що кожна людина має унікальний потенціал, і моя роль полягає в тому, щоб допомогти вам виявити та реалізувати його.

          Мій підхід: У своїй роботі я використовую індивідуальний підхід до кожного клієнта, враховуючи його особисті потреби та життєві обставини. Я вірю, що терапія — це спільний процес, у якому ми разом досліджуємо ваші переживання, емоції та думки, щоб знайти нові способи справлятися з викликами.

          Філософія терапії: Гештальт-терапія фокусується на усвідомленні, прийнятті та інтеграції всіх аспектів вашого "я". Я допомагаю своїм клієнтам розпізнати, які почуття вони переживають у даний момент, і чому це важливо. Цей процес усвідомлення може призвести до значних змін у вашому житті, допомагаючи вам знайти гармонію у стосунках, приймати важливі рішення і зменшувати рівень стресу.

          Освіта та підготовка: Я маю [вказати ступінь] у [вказати галузь] від [вказати навчальний заклад]. Я пройшов спеціалізовані тренінги з гештальт-терапії та продовжую професійний розвиток через семінари, супервізії та участь у професійних об'єднаннях.

          Мої цінності: Я дотримуюсь етичних принципів і ціную конфіденційність, повагу і підтримку в моїй практиці. Моя мета — створити безпечне і прийнятне середовище, де ви зможете відкрито говорити про свої переживання та почуття.

          Запрошення до співпраці: Якщо ви готові зробити перший крок до змін у своєму житті, я запрошую вас звернутися до мене. Давайте разом працювати над вашими цілями і досягненнями, щоб знайти шлях до більш гармонійного та щасливого життя.</p>
      </div>

    </div>
  );
};

export default WelcomeTile;
